Model: "model_4"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
seq1 (InputLayer)               [(None, 2000, 13)]   0                                            
__________________________________________________________________________________________________
seq2 (InputLayer)               [(None, 2000, 13)]   0                                            
__________________________________________________________________________________________________
conv1d_24 (Conv1D)              (None, 1998, 100)    4000        seq1[0][0]                       
                                                                 seq2[0][0]                       
__________________________________________________________________________________________________
max_pooling1d_40 (MaxPooling1D) (None, 666, 100)     0           conv1d_24[0][0]                  
__________________________________________________________________________________________________
max_pooling1d_45 (MaxPooling1D) (None, 666, 100)     0           conv1d_24[1][0]                  
__________________________________________________________________________________________________
bidirectional_20 (Bidirectional (None, 666, 200)     121200      max_pooling1d_40[0][0]           
                                                                 max_pooling1d_45[0][0]           
__________________________________________________________________________________________________
concatenate_40 (Concatenate)    (None, 666, 300)     0           bidirectional_20[0][0]           
                                                                 max_pooling1d_40[0][0]           
__________________________________________________________________________________________________
concatenate_45 (Concatenate)    (None, 666, 300)     0           bidirectional_20[1][0]           
                                                                 max_pooling1d_45[0][0]           
__________________________________________________________________________________________________
conv1d_25 (Conv1D)              (None, 664, 100)     90100       concatenate_40[0][0]             
                                                                 concatenate_45[0][0]             
__________________________________________________________________________________________________
max_pooling1d_41 (MaxPooling1D) (None, 221, 100)     0           conv1d_25[0][0]                  
__________________________________________________________________________________________________
max_pooling1d_46 (MaxPooling1D) (None, 221, 100)     0           conv1d_25[1][0]                  
__________________________________________________________________________________________________
bidirectional_21 (Bidirectional (None, 221, 200)     121200      max_pooling1d_41[0][0]           
                                                                 max_pooling1d_46[0][0]           
__________________________________________________________________________________________________
concatenate_41 (Concatenate)    (None, 221, 300)     0           bidirectional_21[0][0]           
                                                                 max_pooling1d_41[0][0]           
__________________________________________________________________________________________________
concatenate_46 (Concatenate)    (None, 221, 300)     0           bidirectional_21[1][0]           
                                                                 max_pooling1d_46[0][0]           
__________________________________________________________________________________________________
conv1d_26 (Conv1D)              (None, 219, 100)     90100       concatenate_41[0][0]             
                                                                 concatenate_46[0][0]             
__________________________________________________________________________________________________
max_pooling1d_42 (MaxPooling1D) (None, 73, 100)      0           conv1d_26[0][0]                  
__________________________________________________________________________________________________
max_pooling1d_47 (MaxPooling1D) (None, 73, 100)      0           conv1d_26[1][0]                  
__________________________________________________________________________________________________
bidirectional_22 (Bidirectional (None, 73, 200)      121200      max_pooling1d_42[0][0]           
                                                                 max_pooling1d_47[0][0]           
__________________________________________________________________________________________________
concatenate_42 (Concatenate)    (None, 73, 300)      0           bidirectional_22[0][0]           
                                                                 max_pooling1d_42[0][0]           
__________________________________________________________________________________________________
concatenate_47 (Concatenate)    (None, 73, 300)      0           bidirectional_22[1][0]           
                                                                 max_pooling1d_47[0][0]           
__________________________________________________________________________________________________
conv1d_27 (Conv1D)              (None, 71, 100)      90100       concatenate_42[0][0]             
                                                                 concatenate_47[0][0]             
__________________________________________________________________________________________________
max_pooling1d_43 (MaxPooling1D) (None, 23, 100)      0           conv1d_27[0][0]                  
__________________________________________________________________________________________________
max_pooling1d_48 (MaxPooling1D) (None, 23, 100)      0           conv1d_27[1][0]                  
__________________________________________________________________________________________________
bidirectional_23 (Bidirectional (None, 23, 200)      121200      max_pooling1d_43[0][0]           
                                                                 max_pooling1d_48[0][0]           
__________________________________________________________________________________________________
concatenate_43 (Concatenate)    (None, 23, 300)      0           bidirectional_23[0][0]           
                                                                 max_pooling1d_43[0][0]           
__________________________________________________________________________________________________
concatenate_48 (Concatenate)    (None, 23, 300)      0           bidirectional_23[1][0]           
                                                                 max_pooling1d_48[0][0]           
__________________________________________________________________________________________________
conv1d_28 (Conv1D)              (None, 21, 100)      90100       concatenate_43[0][0]             
                                                                 concatenate_48[0][0]             
__________________________________________________________________________________________________
max_pooling1d_44 (MaxPooling1D) (None, 7, 100)       0           conv1d_28[0][0]                  
__________________________________________________________________________________________________
max_pooling1d_49 (MaxPooling1D) (None, 7, 100)       0           conv1d_28[1][0]                  
__________________________________________________________________________________________________
bidirectional_24 (Bidirectional (None, 7, 200)       121200      max_pooling1d_44[0][0]           
                                                                 max_pooling1d_49[0][0]           
__________________________________________________________________________________________________
concatenate_44 (Concatenate)    (None, 7, 300)       0           bidirectional_24[0][0]           
                                                                 max_pooling1d_44[0][0]           
__________________________________________________________________________________________________
concatenate_49 (Concatenate)    (None, 7, 300)       0           bidirectional_24[1][0]           
                                                                 max_pooling1d_49[0][0]           
__________________________________________________________________________________________________
conv1d_29 (Conv1D)              (None, 5, 100)       90100       concatenate_44[0][0]             
                                                                 concatenate_49[0][0]             
__________________________________________________________________________________________________
global_average_pooling1d_8 (Glo (None, 100)          0           conv1d_29[0][0]                  
__________________________________________________________________________________________________
global_average_pooling1d_9 (Glo (None, 100)          0           conv1d_29[1][0]                  
__________________________________________________________________________________________________
multiply_4 (Multiply)           (None, 100)          0           global_average_pooling1d_8[0][0] 
                                                                 global_average_pooling1d_9[0][0] 
__________________________________________________________________________________________________
dense_12 (Dense)                (None, 100)          10100       multiply_4[0][0]                 
__________________________________________________________________________________________________
leaky_re_lu_8 (LeakyReLU)       (None, 100)          0           dense_12[0][0]                   
__________________________________________________________________________________________________
dense_13 (Dense)                (None, 53)           5353        leaky_re_lu_8[0][0]              
__________________________________________________________________________________________________
leaky_re_lu_9 (LeakyReLU)       (None, 53)           0           dense_13[0][0]                   
__________________________________________________________________________________________________
dense_14 (Dense)                (None, 2)            108         leaky_re_lu_9[0][0]              
==================================================================================================
Total params: 1,076,061
Trainable params: 1,076,061
Non-trainable params: 0
__________________________________________________________________________________________________
