Model: "model_3"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
seq1 (InputLayer)               [(None, 2000, 13)]   0                                            
__________________________________________________________________________________________________
seq2 (InputLayer)               [(None, 2000, 13)]   0                                            
__________________________________________________________________________________________________
conv1d_18 (Conv1D)              (None, 1998, 50)     2000        seq1[0][0]                       
                                                                 seq2[0][0]                       
__________________________________________________________________________________________________
max_pooling1d_30 (MaxPooling1D) (None, 666, 50)      0           conv1d_18[0][0]                  
__________________________________________________________________________________________________
max_pooling1d_35 (MaxPooling1D) (None, 666, 50)      0           conv1d_18[1][0]                  
__________________________________________________________________________________________________
bidirectional_15 (Bidirectional (None, 666, 100)     30600       max_pooling1d_30[0][0]           
                                                                 max_pooling1d_35[0][0]           
__________________________________________________________________________________________________
concatenate_30 (Concatenate)    (None, 666, 150)     0           bidirectional_15[0][0]           
                                                                 max_pooling1d_30[0][0]           
__________________________________________________________________________________________________
concatenate_35 (Concatenate)    (None, 666, 150)     0           bidirectional_15[1][0]           
                                                                 max_pooling1d_35[0][0]           
__________________________________________________________________________________________________
conv1d_19 (Conv1D)              (None, 664, 50)      22550       concatenate_30[0][0]             
                                                                 concatenate_35[0][0]             
__________________________________________________________________________________________________
max_pooling1d_31 (MaxPooling1D) (None, 221, 50)      0           conv1d_19[0][0]                  
__________________________________________________________________________________________________
max_pooling1d_36 (MaxPooling1D) (None, 221, 50)      0           conv1d_19[1][0]                  
__________________________________________________________________________________________________
bidirectional_16 (Bidirectional (None, 221, 100)     30600       max_pooling1d_31[0][0]           
                                                                 max_pooling1d_36[0][0]           
__________________________________________________________________________________________________
concatenate_31 (Concatenate)    (None, 221, 150)     0           bidirectional_16[0][0]           
                                                                 max_pooling1d_31[0][0]           
__________________________________________________________________________________________________
concatenate_36 (Concatenate)    (None, 221, 150)     0           bidirectional_16[1][0]           
                                                                 max_pooling1d_36[0][0]           
__________________________________________________________________________________________________
conv1d_20 (Conv1D)              (None, 219, 50)      22550       concatenate_31[0][0]             
                                                                 concatenate_36[0][0]             
__________________________________________________________________________________________________
max_pooling1d_32 (MaxPooling1D) (None, 73, 50)       0           conv1d_20[0][0]                  
__________________________________________________________________________________________________
max_pooling1d_37 (MaxPooling1D) (None, 73, 50)       0           conv1d_20[1][0]                  
__________________________________________________________________________________________________
bidirectional_17 (Bidirectional (None, 73, 100)      30600       max_pooling1d_32[0][0]           
                                                                 max_pooling1d_37[0][0]           
__________________________________________________________________________________________________
concatenate_32 (Concatenate)    (None, 73, 150)      0           bidirectional_17[0][0]           
                                                                 max_pooling1d_32[0][0]           
__________________________________________________________________________________________________
concatenate_37 (Concatenate)    (None, 73, 150)      0           bidirectional_17[1][0]           
                                                                 max_pooling1d_37[0][0]           
__________________________________________________________________________________________________
conv1d_21 (Conv1D)              (None, 71, 50)       22550       concatenate_32[0][0]             
                                                                 concatenate_37[0][0]             
__________________________________________________________________________________________________
max_pooling1d_33 (MaxPooling1D) (None, 23, 50)       0           conv1d_21[0][0]                  
__________________________________________________________________________________________________
max_pooling1d_38 (MaxPooling1D) (None, 23, 50)       0           conv1d_21[1][0]                  
__________________________________________________________________________________________________
bidirectional_18 (Bidirectional (None, 23, 100)      30600       max_pooling1d_33[0][0]           
                                                                 max_pooling1d_38[0][0]           
__________________________________________________________________________________________________
concatenate_33 (Concatenate)    (None, 23, 150)      0           bidirectional_18[0][0]           
                                                                 max_pooling1d_33[0][0]           
__________________________________________________________________________________________________
concatenate_38 (Concatenate)    (None, 23, 150)      0           bidirectional_18[1][0]           
                                                                 max_pooling1d_38[0][0]           
__________________________________________________________________________________________________
conv1d_22 (Conv1D)              (None, 21, 50)       22550       concatenate_33[0][0]             
                                                                 concatenate_38[0][0]             
__________________________________________________________________________________________________
max_pooling1d_34 (MaxPooling1D) (None, 7, 50)        0           conv1d_22[0][0]                  
__________________________________________________________________________________________________
max_pooling1d_39 (MaxPooling1D) (None, 7, 50)        0           conv1d_22[1][0]                  
__________________________________________________________________________________________________
bidirectional_19 (Bidirectional (None, 7, 100)       30600       max_pooling1d_34[0][0]           
                                                                 max_pooling1d_39[0][0]           
__________________________________________________________________________________________________
concatenate_34 (Concatenate)    (None, 7, 150)       0           bidirectional_19[0][0]           
                                                                 max_pooling1d_34[0][0]           
__________________________________________________________________________________________________
concatenate_39 (Concatenate)    (None, 7, 150)       0           bidirectional_19[1][0]           
                                                                 max_pooling1d_39[0][0]           
__________________________________________________________________________________________________
conv1d_23 (Conv1D)              (None, 5, 50)        22550       concatenate_34[0][0]             
                                                                 concatenate_39[0][0]             
__________________________________________________________________________________________________
global_average_pooling1d_6 (Glo (None, 50)           0           conv1d_23[0][0]                  
__________________________________________________________________________________________________
global_average_pooling1d_7 (Glo (None, 50)           0           conv1d_23[1][0]                  
__________________________________________________________________________________________________
multiply_3 (Multiply)           (None, 50)           0           global_average_pooling1d_6[0][0] 
                                                                 global_average_pooling1d_7[0][0] 
__________________________________________________________________________________________________
dense_9 (Dense)                 (None, 100)          5100        multiply_3[0][0]                 
__________________________________________________________________________________________________
leaky_re_lu_6 (LeakyReLU)       (None, 100)          0           dense_9[0][0]                    
__________________________________________________________________________________________________
dense_10 (Dense)                (None, 28)           2828        leaky_re_lu_6[0][0]              
__________________________________________________________________________________________________
leaky_re_lu_7 (LeakyReLU)       (None, 28)           0           dense_10[0][0]                   
__________________________________________________________________________________________________
dense_11 (Dense)                (None, 2)            58          leaky_re_lu_7[0][0]              
==================================================================================================
Total params: 275,736
Trainable params: 275,736
Non-trainable params: 0
__________________________________________________________________________________________________
